app/controllers/books_controller.rb

  def index
    if params[:category].blank?
      @books = Book.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @books = Book.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Technology"]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 2]]

  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]

    if @book.save
---
INSERT INTO "books" ("title", "description", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "4"], ["description", "4"], ["author", "4"], ["user_id", 1], ["created_at", "2016-05-05 23:03:35.962251"], ["updated_at", "2016-05-05 23:03:35.962251"]]

  def update
    @book.category_id = params[:category_id]

    if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Book BB & AD"], ["updated_at", "2016-05-05 22:30:00.731324"], ["id", 2]]